<a href="https://colab.research.google.com/github/hiro-Anzai/tigerfish/blob/master/hello_python_No2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **第二回～機械学習の基礎**

# 1.CSVを読み込んで内容を確認しましょう

In [ ]:
#データ加工・処理
import pandas as pd 
import numpy as np
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

CSVファイル読み込みます

In [ ]:
train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

In [ ]:
#trainデータを読み込む
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
#testデータを読み込む
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

# 配列の形状

In [ ]:
#配列の形状を確認
test_shape = test.shape
train_shape = train.shape
print(test_shape)
print(train_shape)

(418, 11)
(891, 12)

In [ ]:
#基本統計量
test.describe()
train.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

# 2.データセットの欠損の確認

2.データセットの欠損の確認

In [ ]:
#不要なカラムの削除
train = train.drop(["PassengerId", "Name", "Ticket", "Cabin"],axis=1)
test = test.drop(["PassengerId","Name", "Ticket", "Cabin"],axis=1)

In [ ]:
train.head(10)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S
5         0       3    male   NaN      0      0   8.4583        Q
6         0       1    male  54.0      0      0  51.8625        S
7         0       3    male   2.0      3      1  21.0750        S
8         1       3  female  27.0      0      2  11.1333        S
9         1       2  female  14.0      1      0  30.0708        C

In [ ]:
test.head(10)

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S
5       3    male  14.0      0      0   9.2250        S
6       3  female  30.0      0      0   7.6292        Q
7       2    male  26.0      1      1  29.0000        S
8       3  female  18.0      0      0   7.2292        C
9       3    male  21.0      2      0  24.1500        S

In [ ]:
train.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [ ]:
test.isnull().sum()

Pclass       0
Sex          0
Age         86
SibSp        0
Parch        0
Fare         1
Embarked     0
dtype: int64

# 欠損を埋める

Embarkedの欠損を埋める

In [ ]:
#埋める前ではS,C,Q,nanの4種類あることを確認
train["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [ ]:
#Embarkedの欠損を最頻値で埋める
train["Embarked"] = train["Embarked"].fillna(train["Embarked"].mode().iloc[0])

In [ ]:
#埋めた後ではS,C,Qの3種類あることを確認
train["Embarked"].unique()

array(['S', 'C', 'Q'], dtype=object)

In [ ]:
#Ageの欠損を中央値で埋める
train["Age"] = train["Age"].fillna(train["Age"].median())
test["Age"] = test["Age"].fillna(test["Age"].median())

#欠損値がなくなったか確認
train["Age"].isnull().sum()

0

In [ ]:
#欠損値がなくなったか確認
test["Age"].isnull().sum()

0

In [ ]:
#Fareを中央値で埋める
test["Fare"] = test["Fare"].fillna(test["Fare"].median()) 

#欠損がなくなったか確認
test["Fare"].isnull().sum()

0

In [ ]:
#データ型の確認
train.dtypes

Survived      int64
Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Fare        float64
Embarked     object
dtype: object

# 前処理（データセットの事前処理）

In [ ]:
#naleを0に、femaleを1に変換
train["Sex"] = train["Sex"].map({"male":0, "female":1})
test["Sex"] = test["Sex"].map({"male":0, "female":1})

In [ ]:
#Embarkedをダミー変数化
train = pd.get_dummies(train,columns=["Embarked"])
test = pd.get_dummies(test,columns=["Embarked"])

In [ ]:
#訓練データとテストデータに分割
train_set, test_set = train_test_split(train, test_size = 0.2, random_state = 1)

X_train = train_set.iloc[:,1:]
y_train = train_set.iloc[:,0]

X_test = test_set.iloc[:,1:]
y_test = test_set.iloc[:,0]

# 予測モデル その1 「決定木」

In [ ]:
#決定木モデルの作成
K = 5
clf1 =DecisionTreeClassifier(max_depth=K)
clf1 = clf1.fit(X_train, y_train)

In [ ]:
#テストデータの正解率
print('正解率(train):{:.3f}'.format(clf1.score(X_train, y_train)))

正解率(train):0.862

In [ ]:
#テストデータの正解率
print('正解率(test):{:.3f}'.format(clf1.score(X_test, y_test)))

正解率(test):0.777

**演習問題1**
max_depthの値を変えて精度の変化を調べてみましょう

予測モデル その2 「kNN」

# 予測モデル その2 「kNN」

In [ ]:
#データやモデルを構築するためのライブラリ等のインポート
import matplotlib.pyplot as plt
from sklearn.neighbors import KNeighborsClassifier

In [ ]:
#学習
K=2
knn = KNeighborsClassifier(n_neighbors=K)
knn.fit(X_train, y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=2, p=2,
                     weights='uniform')

In [ ]:
print('正解率(train):{:.3f}'.format(knn.score(X_train, y_train)))

正解率(train):0.837

In [ ]:
print('正解率(test):{:.3f}'.format(knn.score(X_test, y_test)))

正解率(test):0.687

演習問題2 n_neighborsの値を変えて精度の変化を調べてみましょう